In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'gruplar':['a','b','c','a','b','c'],
                 'degisken1':[10,23,33,22,11,99],
                 'degisken2':[100,253,333,262,111,969]
},columns=['gruplar','degisken1','degisken2'] )
df

  gruplar  degisken1  degisken2
0       a         10        100
1       b         23        253
2       c         33        333
3       a         22        262
4       b         11        111
5       c         99        969

In [3]:
df.groupby("gruplar").std()#standart sapma

         degisken1   degisken2
gruplar
a         8.485281  114.551299
b         8.485281  100.409163
c        46.669048  449.719913

In [4]:
def filter_func(x):
    return x["degisken1"].std()>9

In [7]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       c         33        333
5       c         99        969